/**
 * 行星名
 */
export enum PlanetName {
  日 = '日',
  月 = '月',
  水 = '水',
  金 = '金',
  火 = '火',
  木 = '木',
  土 = '土',
  计 = '计', // 北交
  罗 = '罗', // 南交
  孛 = '孛',
  气 = '气',
}

export enum PlanetSpeedState {
  疾 = '疾',
  均 = '均',
  迟 = '迟',
}

/**
 * 二十八宿名
 */

export enum LunarMansionsName {
  // 东方七宿
  角 = '角',
  亢 = '亢',
  氐 = '氐',
  房 = '房',
  心 = '心',
  尾 = '尾',
  箕 = '箕',
  // 北方七宿
  斗 = '斗',
  牛 = '牛',
  女 = '女',
  虚 = '虚',
  危 = '危',
  室 = '室',
  壁 = '壁',
  // 西方七宿
  奎 = '奎',
  娄 = '娄',
  胃 = '胃',
  昴 = '昴',
  毕 = '毕',
  觜 = '觜',
  参 = '参',
  // 南方七宿
  井 = '井',
  鬼 = '鬼',
  柳 = '柳',
  星 = '星',
  张 = '张',
  翼 = '翼',
  轸 = '轸',
}

export enum HouseName {
  命 = '命',
  财 = '财',
  兄 = '兄',
  田 = '田',
  子 = '子',
  奴 = '奴',
  妻 = '妻',
  疾 = '疾',
  迁 = '迁',
  官 = '官',
  福 = '福',
  相 = '相',
}
